<?php

#قم بوضع توكن البوت في ملف index.php في سطر 16

$zozamr = "plus"; #الامر الي بتخليه لبوتك ليظهر القائمة الرئيسية مثل /plus 
$namebot = "ALNASR PLUS"; #اسم البوت
$usrbot = "ALNASR_PLUS_BoT"; #يوزر البوت دون علامه@!
$usradmin = "N_R_SY"; #يوزر الادمن دون علامة@!
$useradmin = "@N_R_SY";  #يوزر الادمن مع هذي العلامة@
$iDadmin = 7690150728; #ايدي الادمن
$usrch2 = "plus2122"; #يوزر قناة التفعيلات دون @
$usrch3 = "smscobnm"; #يوزر قناة المتوفر حالي دون علامة@
$usrch1 = "n_1sy"; #يوزر قناة الرسمية بلاعلامة@
$ch1 = "https://t.me/+ejAVLWC0wHw2NzBk"; #رابط قناة الاشعارات وتسجيلات الدخول
$ch2 = "https://t.me/+Sd5GfbQpQN5kZTY0"; #رابط قناة الارقام الملغية ومحاولات الشراء 
$ch3 = "https://t.me/+HeQ9CIZmydEyMjM0"; #رابط قناة الارقام المكتملة للزبائن
$sim1 =-1002856822267; #ايدي قناة التفعيلات 
$sim =-1002519996840; #ايدي القناة الرسمية
$PAY =-1002263662571; #الارقام المكتملة
$ess =-1002891640555; #عمليات شراء الارقام
$eer =-1002779877044; #اشعارات الايميلات وتحويل الروبل

if($chat_id==$iDadmin){
$sudo=$chat_id;
}elseif($chat_id==$iDadmin){
$sudo=$chat_id;
}else{
$sudo=$iDadmin;
}
#=========الملف تابع }=========#

?>